dragonman225/stm32f469-usbaudio/Middlewares/ST/STM32_USB_Device_Library/Class/AUDIO/Src/usbd_audio.c
uint32_t volatile sof_count = 0;
uint32_t volatile audio_out_halfcplt_count = 0;
uint32_t volatile tx_flag = 0;
uint32_t volatile is_playing = 0;
uint32_t volatile fnsof = 0;

/**
  * @}
  */

/** @defgroup USBD_AUDIO_Private_Functions
  * @{
  */

/**
  * @brief  USBD_AUDIO_Init
  *         Initialize the AUDIO interface
  * @param  pdev: device instance
  * @param  cfgidx: Configuration index
  * @retval status
  */
static uint8_t USBD_AUDIO_Init(USBD_HandleTypeDef* pdev, uint8_t cfgidx)
{
  USBD_AUDIO_HandleTypeDef* haudio;

  /* Open EP OUT */
  USBD_LL_OpenEP(pdev, AUDIO_OUT_EP, USBD_EP_TYPE_ISOC, AUDIO_OUT_PACKET);
  pdev->ep_out[AUDIO_OUT_EP & 0xFU].is_used = 1U;

  /* Open EP IN */
  USBD_LL_OpenEP(pdev, AUDIO_IN_EP, USBD_EP_TYPE_ISOC, 3);
  pdev->ep_in[AUDIO_IN_EP & 0xFU].is_used = 1U;

  USBD_LL_FlushEP(pdev, AUDIO_IN_EP);

  /* Allocate Audio structure */
  pdev->pClassData = USBD_malloc(sizeof(USBD_AUDIO_HandleTypeDef));

  if (pdev->pClassData == NULL) {
    return USBD_FAIL;
  } else {
    haudio = (USBD_AUDIO_HandleTypeDef*)pdev->pClassData;
    haudio->alt_setting = 0U;
    haudio->offset = AUDIO_OFFSET_UNKNOWN;
    haudio->wr_ptr = 0U;
    haudio->rd_ptr = 0U;
    haudio->rd_enable = 0U;

    /* Initialize the Audio output Hardware layer */
    if (((USBD_AUDIO_ItfTypeDef*)pdev->pUserData)->Init(USBD_AUDIO_FREQ, AUDIO_DEFAULT_VOLUME, 0U) != 0) {
      return USBD_FAIL;
    }

    /** 
     * Set tx_flag 1 to block feedback transmission in SOF handler when 
     * things are not ready.
     */
    tx_flag = 1U;

    /* Prepare Out endpoint to receive 1st packet */
    // USBD_LL_PrepareReceive(pdev, AUDIO_OUT_EP, haudio->buffer,
    //                        AUDIO_OUT_PACKET);
  }
  return USBD_OK;
}

/**
  * @brief  USBD_AUDIO_Init
  *         DeInitialize the AUDIO layer
  * @param  pdev: device instance
  * @param  cfgidx: Configuration index
  * @retval status
  */
static uint8_t USBD_AUDIO_DeInit(USBD_HandleTypeDef* pdev,
                                 uint8_t cfgidx)
{
  USBD_LL_FlushEP(pdev, AUDIO_OUT_EP);
  USBD_LL_FlushEP(pdev, AUDIO_IN_EP);

  /* Close EP OUT */
  USBD_LL_CloseEP(pdev, AUDIO_OUT_EP);
  pdev->ep_out[AUDIO_OUT_EP & 0xFU].is_used = 0U;

  /* Close EP IN */
  USBD_LL_CloseEP(pdev, AUDIO_IN_EP);
  pdev->ep_in[AUDIO_IN_EP & 0xFU].is_used = 0U;

  tx_flag = 0U;

  /* DeInit  physical Interface components */
  if (pdev->pClassData != NULL) {
    ((USBD_AUDIO_ItfTypeDef*)pdev->pUserData)->DeInit(0U);
    USBD_free(pdev->pClassData);
    pdev->pClassData = NULL;
  }

  return USBD_OK;
}

/**
  * @brief  USBD_AUDIO_Setup
  *         Handle the AUDIO specific requests
  * @param  pdev: instance
  * @param  req: usb requests
  * @retval status
  */
static uint8_t USBD_AUDIO_Setup(USBD_HandleTypeDef* pdev,
                                USBD_SetupReqTypedef* req)
{
  USBD_AUDIO_HandleTypeDef* haudio;
  uint16_t len;
  uint8_t* pbuf;
  uint16_t status_info = 0U;
  uint8_t ret = USBD_OK;

  haudio = (USBD_AUDIO_HandleTypeDef*)pdev->pClassData;

  switch (req->bmRequest & USB_REQ_TYPE_MASK) {
    /* AUDIO Class Requests */
    case USB_REQ_TYPE_CLASS:
      switch (req->bRequest) {
        case AUDIO_REQ_GET_CUR:
          AUDIO_REQ_GetCurrent(pdev, req);
          break;

        case AUDIO_REQ_SET_CUR:
          AUDIO_REQ_SetCurrent(pdev, req);
          break;

        default:
          USBD_CtlError(pdev, req);
          ret = USBD_FAIL;
          break;
      }
      break;

    /* Standard Requests */
    case USB_REQ_TYPE_STANDARD:
      switch (req->bRequest) {
        case USB_REQ_GET_STATUS:
          if (pdev->dev_state == USBD_STATE_CONFIGURED) {
            USBD_CtlSendData(pdev, (uint8_t*)(void*)&status_info, 2U);
          } else {
            USBD_CtlError(pdev, req);
            ret = USBD_FAIL;
          }
          break;

        case USB_REQ_GET_DESCRIPTOR:
          if ((req->wValue >> 8) == AUDIO_DESCRIPTOR_TYPE) {
            pbuf = USBD_AUDIO_CfgDesc + 18;
            len = MIN(USB_AUDIO_DESC_SIZ, req->wLength);

            USBD_CtlSendData(pdev, pbuf, len);
          }
          break;

        case USB_REQ_GET_INTERFACE:
          if (pdev->dev_state == USBD_STATE_CONFIGURED) {
            USBD_CtlSendData(pdev, (uint8_t*)(void*)&haudio->alt_setting, 1U);
          } else {
            USBD_CtlError(pdev, req);
            ret = USBD_FAIL;
          }
          break;

        case USB_REQ_SET_INTERFACE:
          if (pdev->dev_state == USBD_STATE_CONFIGURED) {
            if ((uint8_t)(req->wValue) <= USBD_MAX_NUM_INTERFACES) {
              haudio->alt_setting = (uint8_t)(req->wValue);
              /**
               * Set tx_flag 0 to allow feedback transmission when setup 
               * ready.
               */
              if (haudio->alt_setting == 1U) {
                sof_count = 0U;
                tx_flag = 0U;
              }
              if (haudio->alt_setting == 0U) {
                tx_flag = 0U;
              }
              USBD_LL_FlushEP(pdev, AUDIO_IN_EP);
            } else {
              /* Call the error management function (command will be nacked */
              USBD_CtlError(pdev, req);
              ret = USBD_FAIL;
            }
          } else {
            USBD_CtlError(pdev, req);
            ret = USBD_FAIL;
          }
          break;

        default:
          USBD_CtlError(pdev, req);
          ret = USBD_FAIL;
          break;
      }
      break;
    default:
      USBD_CtlError(pdev, req);
      ret = USBD_FAIL;
      break;
  }

  return ret;
}

/**
  * @brief  USBD_AUDIO_GetCfgDesc
  *         return configuration descriptor
  * @param  speed : current device speed
  * @param  length : pointer data length
  * @retval pointer to descriptor buffer
  */
static uint8_t* USBD_AUDIO_GetCfgDesc(uint16_t* length)
{
  *length = sizeof(USBD_AUDIO_CfgDesc);
  return USBD_AUDIO_CfgDesc;
}

/**
  * @brief  USBD_AUDIO_DataIn
  *         handle data IN Stage
  * @param  pdev: device instance
  * @param  epnum: endpoint index
  * @retval status
  */
static uint8_t USBD_AUDIO_DataIn(USBD_HandleTypeDef* pdev,
                                 uint8_t epnum)
{
  /* bEndpointAddress[7] is 1 for IN endpoint. See UAC 1.0 spec, p.61 */
  if (epnum == (AUDIO_IN_EP & 0x7f)) {
    tx_flag = 0U;
    /** 
     * Do not clear sof_count or it will never reach desired 
     * feedback-update-period set in SOF handler.
     */
    //sof_count = 0U;
  }
  return USBD_OK;
}

/**
  * @brief  USBD_AUDIO_EP0_RxReady
  *         handle EP0 Rx Ready event
  * @param  pdev: device instance
  * @retval status
  */
static uint8_t USBD_AUDIO_EP0_RxReady(USBD_HandleTypeDef* pdev)
{
  USBD_AUDIO_HandleTypeDef* haudio;
  haudio = (USBD_AUDIO_HandleTypeDef*)pdev->pClassData;

  if (haudio->control.cmd == AUDIO_REQ_SET_CUR) { /* In this driver, to simplify code, only SET_CUR request is managed */

    if (haudio->control.unit == AUDIO_OUT_STREAMING_CTRL) {
      ((USBD_AUDIO_ItfTypeDef*)pdev->pUserData)->MuteCtl(haudio->control.data[0]);
      haudio->control.cmd = 0U;
      haudio->control.len = 0U;
    }
  }

  return USBD_OK;
}
/**
  * @brief  USBD_AUDIO_EP0_TxReady
  *         handle EP0 TRx Ready event
  * @param  pdev: device instance
  * @retval status
  */
static uint8_t USBD_AUDIO_EP0_TxReady(USBD_HandleTypeDef* pdev)
{
  /* Only OUT control data are processed */
  return USBD_OK;
}
/**
  * @brief  USBD_AUDIO_SOF
  *         handle SOF event
  * @param  pdev: device instance
  * @retval status
  */
static uint8_t USBD_AUDIO_SOF(USBD_HandleTypeDef* pdev)
{
  USBD_AUDIO_HandleTypeDef* haudio;
  haudio = (USBD_AUDIO_HandleTypeDef*)pdev->pClassData;

  /* Order of 3 bytes of 10.14 format: { LO byte, MID byte, HI byte } */
  //uint8_t fb_data[3] = {0x00, 0xC0, 0x2F};

  /* 10.14 converter 30.00 -> C0.00 */
  /**
   * 1. Must be static so that the value is kept when function is not called.
   * 2. Must be volatile so that it can survive compiler optimization.
   */
  static volatile uint32_t fb_value = 0x2FC00000 >> 2;
  static volatile uint32_t audio_buf_writable_size_last = AUDIO_TOTAL_BUF_SIZE / 2U;
  static volatile int32_t fb_raw = 0x2FC00000 >> 2;

  /* Do stuff only when playing */
  if (haudio->rd_enable == 1U) {
    // if (remain_buf < AUDIO_TOTAL_BUF_SIZE / 4)
    //   fb_value = 0x2E600000 >> 2;
    // else if (remain_buf < AUDIO_TOTAL_BUF_SIZE / 2)
    //   fb_value = 0x2F000000 >> 2;
    // else if (remain_buf < AUDIO_TOTAL_BUF_SIZE * 3 / 4)
    //   fb_value = 0x2FC00000 >> 2;
    // else if (remain_buf < AUDIO_TOTAL_BUF_SIZE)
    //   fb_value = 0x30000000 >> 2;

    //fb_raw = (uint32_t)(((float)48U / (float)AUDIO_TOTAL_BUF_SIZE) * (float)remain_buf);
    //fb_raw = 100U * remain_buf / AUDIO_TOTAL_BUF_SIZE;

    // if (fb_sent == 0U) {
    //   USBD_LL_Transmit(pdev, AUDIO_IN_EP, fb_data, 3U);
    //   fb_sent = 1U;
    // }

    /* Calculate remaining writable buffer */
    uint32_t audio_buf_writable_size;
    haudio->rd_ptr = AUDIO_TOTAL_BUF_SIZE - BSP_AUDIO_OUT_GetRemainingDataSize();
    if (haudio->rd_ptr < haudio->wr_ptr) {
      audio_buf_writable_size = haudio->rd_ptr + AUDIO_TOTAL_BUF_SIZE - haudio->wr_ptr;
    } else {
      audio_buf_writable_size = haudio->rd_ptr - haudio->wr_ptr;
    }

    /* Monitor remaining writable buffer size */
    if (audio_buf_writable_size < AUDIO_BUF_SAFEZONE) {
      BSP_LED_On(LED2);
    } else {
      BSP_LED_Off(LED2);
    }

    /* Calculate feedback value based on the change of writable buffer */
    int32_t audio_buf_writable_size_change;
    audio_buf_writable_size_change = audio_buf_writable_size - audio_buf_writable_size_last;
    fb_raw += audio_buf_writable_size_change * 10000;
    fb_value = (uint32_t)fb_raw;

